RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * LO1ZC (RW)
 *
 * Left Headphone Output Zero Cross Enable
 * 0 = Change gain immediately
 * 1 = Change gain on zero cross only
 */
#define WM8960_LOUT1_LO1ZC_MASK (0x80U)
#define WM8960_LOUT1_LO1ZC_SHIFT (7U)
#define WM8960_LOUT1_LO1ZC_SET(x) (((uint16_t)(x) << WM8960_LOUT1_LO1ZC_SHIFT) & WM8960_LOUT1_LO1ZC_MASK)
#define WM8960_LOUT1_LO1ZC_GET(x) (((uint16_t)(x) & WM8960_LOUT1_LO1ZC_MASK) >> WM8960_LOUT1_LO1ZC_SHIFT)

/*
 * LOUT1VOL (RW)
 *
 * LOUT1 Volume
 * 1111111 = +6dB
 * … 1dB steps down to
 * 0110000 = -73dB
 * 0101111 to 0000000 = Analogue MUTE
 */
#define WM8960_LOUT1_LOUT1VOL_MASK (0x7FU)
#define WM8960_LOUT1_LOUT1VOL_SHIFT (0U)
#define WM8960_LOUT1_LOUT1VOL_SET(x) (((uint16_t)(x) << WM8960_LOUT1_LOUT1VOL_SHIFT) & WM8960_LOUT1_LOUT1VOL_MASK)
#define WM8960_LOUT1_LOUT1VOL_GET(x) (((uint16_t)(x) & WM8960_LOUT1_LOUT1VOL_MASK) >> WM8960_LOUT1_LOUT1VOL_SHIFT)

/* Bitfield definition for register: ROUT1 */
/*
 * OUT1VU (RW)
 *
 * Headphone Output PGA Volume Update
 * Writing a 1 to this bit will cause left and right
 * headphone output volumes to be updated
 * (LOUT1VOL and ROUT1VOL)
 */
#define WM8960_ROUT1_OUT1VU_MASK (0x100U)
#define WM8960_ROUT1_OUT1VU_SHIFT (8U)
#define WM8960_ROUT1_OUT1VU_SET(x) (((uint16_t)(x) << WM8960_ROUT1_OUT1VU_SHIFT) & WM8960_ROUT1_OUT1VU_MASK)
#define WM8960_ROUT1_OUT1VU_GET(x) (((uint16_t)(x) & WM8960_ROUT1_OUT1VU_MASK) >> WM8960_ROUT1_OUT1VU_SHIFT)

/*
 * RO1ZC (RW)
 *
 * Right Headphone Output Zero Cross Enable
 * 0 = Change gain immediately
 * 1 = Change gain on zero cross only
 */
#define WM8960_ROUT1_RO1ZC_MASK (0x80U)
#define WM8960_ROUT1_RO1ZC_SHIFT (7U)
#define WM8960_ROUT1_RO1ZC_SET(x) (((uint16_t)(x) << WM8960_ROUT1_RO1ZC_SHIFT) & WM8960_ROUT1_RO1ZC_MASK)
#define WM8960_ROUT1_RO1ZC_GET(x) (((uint16_t)(x) & WM8960_ROUT1_RO1ZC_MASK) >> WM8960_ROUT1_RO1ZC_SHIFT)

/*
 * ROUT1VOL (RW)
 *
 * ROUT1 Volume
 * 1111111 = +6dB
 * … 1dB steps down to
 * 0110000 = -73dB
 * 0101111 to 0000000 = Analogue MUTE
 */
#define WM8960_ROUT1_ROUT1VOL_MASK (0x7FU)
#define WM8960_ROUT1_ROUT1VOL_SHIFT (0U)
#define WM8960_ROUT1_ROUT1VOL_SET(x) (((uint16_t)(x) << WM8960_ROUT1_ROUT1VOL_SHIFT) & WM8960_ROUT1_ROUT1VOL_MASK)
#define WM8960_ROUT1_ROUT1VOL_GET(x) (((uint16_t)(x) & WM8960_ROUT1_ROUT1VOL_MASK) >> WM8960_ROUT1_ROUT1VOL_SHIFT)

/* Bitfield definition for register: CLOCK1 */
/*
 * ADCDIV (RW)
 *
 * ADC Sample rate divider (Also determines
 * ADCLRC in master mode)
 * 000 = SYSCLK / (1.0 * 256)
 * 001 = SYSCLK / (1.5 * 256)
 * 010 = SYSCLK / (2 * 256)
 * 011 = SYSCLK / (3 * 256)
 * 100 = SYSCLK / (4 * 256)
 * 101 = SYSCLK / (5.5 * 256)
 * 110 = SYSCLK / (6 * 256)
 * 111 = Reserved
 */
#define WM8960_CLOCK1_ADCDIV_MASK (0x1C0U)
#define WM8960_CLOCK1_ADCDIV_SHIFT (6U)
#define WM8960_CLOCK1_ADCDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK1_ADCDIV_SHIFT) & WM8960_CLOCK1_ADCDIV_MASK)
#define WM8960_CLOCK1_ADCDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK1_ADCDIV_MASK) >> WM8960_CLOCK1_ADCDIV_SHIFT)

/*
 * DACDIV (RW)
 *
 * DAC Sample rate divider (Also determines
 * DACLRC in master mode)
 * 000 = SYSCLK / (1.0 * 256)
 * 001 = SYSCLK / (1.5 * 256)
 * 010 = SYSCLK / (2 * 256)
 * 011 = SYSCLK / (3 * 256)
 * 100 = SYSCLK / (4 * 256)
 * 101 = SYSCLK / (5.5 * 256)
 * 110 = SYSCLK / (6 * 256)
 * 111 = Reserved
 */
#define WM8960_CLOCK1_DACDIV_MASK (0x38U)
#define WM8960_CLOCK1_DACDIV_SHIFT (3U)
#define WM8960_CLOCK1_DACDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK1_DACDIV_SHIFT) & WM8960_CLOCK1_DACDIV_MASK)
#define WM8960_CLOCK1_DACDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK1_DACDIV_MASK) >> WM8960_CLOCK1_DACDIV_SHIFT)

/*
 * SYSCLKDIV (RW)
 *
 * SYSCLK Pre-divider. Clock source (MCLK or
 * PLL output) will be divided by this value to
 * generate SYSCLK.
 * 00 = Divide SYSCLK by 1
 * 01 = Reserved
 * 10 = Divide SYSCLK by 2
 * 11 = Reserved
 */
#define WM8960_CLOCK1_SYSCLKDIV_MASK (0x6U)
#define WM8960_CLOCK1_SYSCLKDIV_SHIFT (1U)
#define WM8960_CLOCK1_SYSCLKDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK1_SYSCLKDIV_SHIFT) & WM8960_CLOCK1_SYSCLKDIV_MASK)
#define WM8960_CLOCK1_SYSCLKDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK1_SYSCLKDIV_MASK) >> WM8960_CLOCK1_SYSCLKDIV_SHIFT)

/*
 * CLKSEL (RW)
 *
 * SYSCLK Selection
 * 0 = SYSCLK derived from MCLK
 * 1 = SYSCLK derived from PLL output
 */
#define WM8960_CLOCK1_CLKSEL_MASK (0x1U)
#define WM8960_CLOCK1_CLKSEL_SHIFT (0U)
#define WM8960_CLOCK1_CLKSEL_SET(x) (((uint16_t)(x) << WM8960_CLOCK1_CLKSEL_SHIFT) & WM8960_CLOCK1_CLKSEL_MASK)
#define WM8960_CLOCK1_CLKSEL_GET(x) (((uint16_t)(x) & WM8960_CLOCK1_CLKSEL_MASK) >> WM8960_CLOCK1_CLKSEL_SHIFT)

/* Bitfield definition for register: DACCTL1 */
/*
 * DACDIV2 (RW)
 *
 * DAC 6dB Attenuate Enable
 * 0 = Disabled (0dB)
 * 1 = -6dB Enabled
 */
#define WM8960_DACCTL1_DACDIV2_MASK (0x80U)
#define WM8960_DACCTL1_DACDIV2_SHIFT (7U)
#define WM8960_DACCTL1_DACDIV2_SET(x) (((uint16_t)(x) << WM8960_DACCTL1_DACDIV2_SHIFT) & WM8960_DACCTL1_DACDIV2_MASK)
#define WM8960_DACCTL1_DACDIV2_GET(x) (((uint16_t)(x) & WM8960_DACCTL1_DACDIV2_MASK) >> WM8960_DACCTL1_DACDIV2_SHIFT)

/*
 * ADCPOL (RW)
 *
 * ADC polarity control:
 * 00 = Polarity not inverted
 * 01 = ADC L inverted
 * 10 = ADC R inverted
 * 11 = ADC L and R inverted
 */
#define WM8960_DACCTL1_ADCPOL_MASK (0x60U)
#define WM8960_DACCTL1_ADCPOL_SHIFT (5U)
#define WM8960_DACCTL1_ADCPOL_SET(x) (((uint16_t)(x) << WM8960_DACCTL1_ADCPOL_SHIFT) & WM8960_DACCTL1_ADCPOL_MASK)
#define WM8960_DACCTL1_ADCPOL_GET(x) (((uint16_t)(x) & WM8960_DACCTL1_ADCPOL_MASK) >> WM8960_DACCTL1_ADCPOL_SHIFT)

/*
 * DACMU (RW)
 *
 * DAC Digital Soft Mute
 * 1 = Mute
 * 0 = No mute (signal active)
 */
#define WM8960_DACCTL1_DACMU_MASK (0x8U)
#define WM8960_DACCTL1_DACMU_SHIFT (3U)
#define WM8960_DACCTL1_DACMU_SET(x) (((uint16_t)(x) << WM8960_DACCTL1_DACMU_SHIFT) & WM8960_DACCTL1_DACMU_MASK)
#define WM8960_DACCTL1_DACMU_GET(x) (((uint16_t)(x) & WM8960_DACCTL1_DACMU_MASK) >> WM8960_DACCTL1_DACMU_SHIFT)

/*
 * DEEMPH (RW)
 *
 * De-emphasis Control
 * 11 = 48kHz sample rate
 * 10 = 44.1kHz sample rate
 * 01 = 32kHz sample rate
 * 00 = No de-emphasis
 */
#define WM8960_DACCTL1_DEEMPH_MASK (0x6U)
#define WM8960_DACCTL1_DEEMPH_SHIFT (1U)
#define WM8960_DACCTL1_DEEMPH_SET(x) (((uint16_t)(x) << WM8960_DACCTL1_DEEMPH_SHIFT) & WM8960_DACCTL1_DEEMPH_MASK)
#define WM8960_DACCTL1_DEEMPH_GET(x) (((uint16_t)(x) & WM8960_DACCTL1_DEEMPH_MASK) >> WM8960_DACCTL1_DEEMPH_SHIFT)

