RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * ADCHPD (RW)
 *
 * ADC High Pass Filter Disable
 * 0 = Enable high pass filter on left and right channels
 * 1 = Disable high pass filter on left and right channels
 */
#define WM8960_DACCTL1_ADCHPD_MASK (0x1U)
#define WM8960_DACCTL1_ADCHPD_SHIFT (0U)
#define WM8960_DACCTL1_ADCHPD_SET(x) (((uint16_t)(x) << WM8960_DACCTL1_ADCHPD_SHIFT) & WM8960_DACCTL1_ADCHPD_MASK)
#define WM8960_DACCTL1_ADCHPD_GET(x) (((uint16_t)(x) & WM8960_DACCTL1_ADCHPD_MASK) >> WM8960_DACCTL1_ADCHPD_SHIFT)

/* Bitfield definition for register: DACCTL2 */
/*
 * DACPOL (RW)
 *
 * DAC polarity control:
 * 00 = Polarity not inverted
 * 01 = DAC L inverted
 * 10 = DAC R inverted
 * 11 = DAC L and R inverted
 */
#define WM8960_DACCTL2_DACPOL_MASK (0x60U)
#define WM8960_DACCTL2_DACPOL_SHIFT (5U)
#define WM8960_DACCTL2_DACPOL_SET(x) (((uint16_t)(x) << WM8960_DACCTL2_DACPOL_SHIFT) & WM8960_DACCTL2_DACPOL_MASK)
#define WM8960_DACCTL2_DACPOL_GET(x) (((uint16_t)(x) & WM8960_DACCTL2_DACPOL_MASK) >> WM8960_DACCTL2_DACPOL_SHIFT)

/*
 * DACSMM (RW)
 *
 * DAC Soft Mute Mode
 * 0 = Disabling soft-mute (DACMU=0) will cause
 * the volume to change immediately to the
 * LDACVOL / RDACVOL settings
 * 1 = Disabling soft-mute (DACMU=0) will cause
 * the volume to ramp up gradually to the
 * LDACVOL / RDACVOL settings
 */
#define WM8960_DACCTL2_DACSMM_MASK (0x8U)
#define WM8960_DACCTL2_DACSMM_SHIFT (3U)
#define WM8960_DACCTL2_DACSMM_SET(x) (((uint16_t)(x) << WM8960_DACCTL2_DACSMM_SHIFT) & WM8960_DACCTL2_DACSMM_MASK)
#define WM8960_DACCTL2_DACSMM_GET(x) (((uint16_t)(x) & WM8960_DACCTL2_DACSMM_MASK) >> WM8960_DACCTL2_DACSMM_SHIFT)

/*
 * DACMR (RW)
 *
 * DAC Soft Mute Ramp Rate
 * 0 = Fast ramp (24kHz at fs=48k, providing
 * maximum delay of 10.7ms)
 * 1 = Slow ramp (1.5kHz at fs=48k, providing
 * maximum delay of 171ms)
 */
#define WM8960_DACCTL2_DACMR_MASK (0x4U)
#define WM8960_DACCTL2_DACMR_SHIFT (2U)
#define WM8960_DACCTL2_DACMR_SET(x) (((uint16_t)(x) << WM8960_DACCTL2_DACMR_SHIFT) & WM8960_DACCTL2_DACMR_MASK)
#define WM8960_DACCTL2_DACMR_GET(x) (((uint16_t)(x) & WM8960_DACCTL2_DACMR_MASK) >> WM8960_DACCTL2_DACMR_SHIFT)

/*
 * DACSLOPE (RW)
 *
 * Selects DAC filter characteristics
 * 0 = Normal mode
 * 1 = Sloping stopband
 */
#define WM8960_DACCTL2_DACSLOPE_MASK (0x2U)
#define WM8960_DACCTL2_DACSLOPE_SHIFT (1U)
#define WM8960_DACCTL2_DACSLOPE_SET(x) (((uint16_t)(x) << WM8960_DACCTL2_DACSLOPE_SHIFT) & WM8960_DACCTL2_DACSLOPE_MASK)
#define WM8960_DACCTL2_DACSLOPE_GET(x) (((uint16_t)(x) & WM8960_DACCTL2_DACSLOPE_MASK) >> WM8960_DACCTL2_DACSLOPE_SHIFT)

/* Bitfield definition for register: IFACE1 */
/*
 * ALRSWAP (RW)
 *
 * Left/Right ADC Channel Swap
 * 1 = Swap left and right ADC data in audio
 * interface
 * 0 = Output left and right data as normal
 */
#define WM8960_IFACE1_ALRSWAP_MASK (0x100U)
#define WM8960_IFACE1_ALRSWAP_SHIFT (8U)
#define WM8960_IFACE1_ALRSWAP_SET(x) (((uint16_t)(x) << WM8960_IFACE1_ALRSWAP_SHIFT) & WM8960_IFACE1_ALRSWAP_MASK)
#define WM8960_IFACE1_ALRSWAP_GET(x) (((uint16_t)(x) & WM8960_IFACE1_ALRSWAP_MASK) >> WM8960_IFACE1_ALRSWAP_SHIFT)

/*
 * BCLKINV (RW)
 *
 * BCLK invert bit (for master and slave modes)
 * 0 = BCLK not inverted
 * 1 = BCLK inverted
 */
#define WM8960_IFACE1_BCLKINV_MASK (0x80U)
#define WM8960_IFACE1_BCLKINV_SHIFT (7U)
#define WM8960_IFACE1_BCLKINV_SET(x) (((uint16_t)(x) << WM8960_IFACE1_BCLKINV_SHIFT) & WM8960_IFACE1_BCLKINV_MASK)
#define WM8960_IFACE1_BCLKINV_GET(x) (((uint16_t)(x) & WM8960_IFACE1_BCLKINV_MASK) >> WM8960_IFACE1_BCLKINV_SHIFT)

/*
 * MS (RW)
 *
 * Master / Slave Mode Control
 * 0 = Enable slave mode
 * 1 = Enable master mode
 */
#define WM8960_IFACE1_MS_MASK (0x40U)
#define WM8960_IFACE1_MS_SHIFT (6U)
#define WM8960_IFACE1_MS_SET(x) (((uint16_t)(x) << WM8960_IFACE1_MS_SHIFT) & WM8960_IFACE1_MS_MASK)
#define WM8960_IFACE1_MS_GET(x) (((uint16_t)(x) & WM8960_IFACE1_MS_MASK) >> WM8960_IFACE1_MS_SHIFT)

/*
 * DLRSWAP (RW)
 *
 * Left/Right DAC Channel Swap
 * 0 = Output left and right data as normal
 * 1 = Swap left and right DAC data in audio interface
 */
#define WM8960_IFACE1_DLRSWAP_MASK (0x20U)
#define WM8960_IFACE1_DLRSWAP_SHIFT (5U)
#define WM8960_IFACE1_DLRSWAP_SET(x) (((uint16_t)(x) << WM8960_IFACE1_DLRSWAP_SHIFT) & WM8960_IFACE1_DLRSWAP_MASK)
#define WM8960_IFACE1_DLRSWAP_GET(x) (((uint16_t)(x) & WM8960_IFACE1_DLRSWAP_MASK) >> WM8960_IFACE1_DLRSWAP_SHIFT)

/*
 * LRP (RW)
 *
 * Right, left and I2S modes – LRCLK polarity
 * 0 = normal LRCLK polarity
 * 1 = invert LRCLK polarity
 * DSP Mode – mode A/B select
 * 0 = MSB is available on 2nd BCLK rising edge after LRC rising edge (mode A)
 * 1 = MSB is available on 1st BCLK rising edge after LRC rising edge (mode B)
 */
#define WM8960_IFACE1_LRP_MASK (0x10U)
#define WM8960_IFACE1_LRP_SHIFT (4U)
#define WM8960_IFACE1_LRP_SET(x) (((uint16_t)(x) << WM8960_IFACE1_LRP_SHIFT) & WM8960_IFACE1_LRP_MASK)
#define WM8960_IFACE1_LRP_GET(x) (((uint16_t)(x) & WM8960_IFACE1_LRP_MASK) >> WM8960_IFACE1_LRP_SHIFT)

/*
 * WL (RW)
 *
 * Audio Data Word Length
 * 00 = 16 bits
 * 01 = 20 bits
 * 10 = 24 bits
 * 11 = 32 bits (see Note)
 */
#define WM8960_IFACE1_WL_MASK (0xCU)
#define WM8960_IFACE1_WL_SHIFT (2U)
#define WM8960_IFACE1_WL_SET(x) (((uint16_t)(x) << WM8960_IFACE1_WL_SHIFT) & WM8960_IFACE1_WL_MASK)
#define WM8960_IFACE1_WL_GET(x) (((uint16_t)(x) & WM8960_IFACE1_WL_MASK) >> WM8960_IFACE1_WL_SHIFT)

/*
 * FORMAT (RW)
 *
 * 00 = Right justified
 * 01 = Left justified
 * 10 = I2S Format
 * 11 = DSP Mode
 */
#define WM8960_IFACE1_FORMAT_MASK (0x3U)
#define WM8960_IFACE1_FORMAT_SHIFT (0U)
#define WM8960_IFACE1_FORMAT_SET(x) (((uint16_t)(x) << WM8960_IFACE1_FORMAT_SHIFT) & WM8960_IFACE1_FORMAT_MASK)
#define WM8960_IFACE1_FORMAT_GET(x) (((uint16_t)(x) & WM8960_IFACE1_FORMAT_MASK) >> WM8960_IFACE1_FORMAT_SHIFT)

/* Bitfield definition for register: CLOCK2 */
/*
 * DCLKDIV (RW)
 *
 * Class D switching clock divider.
 * 000 = SYSCLK / 1.5 (Not recommended)
 * 001 = SYSCLK / 2
 * 010 = SYSCLK / 3
 * 011 = SYSCLK / 4
 * 100 = SYSCLK / 6
 * 101 = SYSCLK / 8
 * 110 = SYSCLK / 12
 * 111 = SYSCLK / 16
 */
#define WM8960_CLOCK2_DCLKDIV_MASK (0x1C0U)
#define WM8960_CLOCK2_DCLKDIV_SHIFT (6U)
#define WM8960_CLOCK2_DCLKDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK2_DCLKDIV_SHIFT) & WM8960_CLOCK2_DCLKDIV_MASK)
#define WM8960_CLOCK2_DCLKDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK2_DCLKDIV_MASK) >> WM8960_CLOCK2_DCLKDIV_SHIFT)

