RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * 3DDEPTH (RW)
 *
 * 3D Stereo Depth
 * 0000 = 0% (minimum 3D effect)
 * 0001 = 6.67%
 * ....
 * 1110 = 93.3%
 * 1111 = 100% (maximum 3D effect)
 */
#define WM8960_3D_3DDEPTH_MASK (0x1EU)
#define WM8960_3D_3DDEPTH_SHIFT (1U)
#define WM8960_3D_3DDEPTH_SET(x) (((uint16_t)(x) << WM8960_3D_3DDEPTH_SHIFT) & WM8960_3D_3DDEPTH_MASK)
#define WM8960_3D_3DDEPTH_GET(x) (((uint16_t)(x) & WM8960_3D_3DDEPTH_MASK) >> WM8960_3D_3DDEPTH_SHIFT)

/*
 * 3DEN (RW)
 *
 * 3D Stereo Enhancement Enable
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_3D_3DEN_MASK (0x1U)
#define WM8960_3D_3DEN_SHIFT (0U)
#define WM8960_3D_3DEN_SET(x) (((uint16_t)(x) << WM8960_3D_3DEN_SHIFT) & WM8960_3D_3DEN_MASK)
#define WM8960_3D_3DEN_GET(x) (((uint16_t)(x) & WM8960_3D_3DEN_MASK) >> WM8960_3D_3DEN_SHIFT)

/* Bitfield definition for register: ALC1 */
/*
 * ALCSEL (RW)
 *
 * ALC Function Select
 * 00 = ALC off (PGA gain set by register)
 * 01 = Right channel only
 * 10 = Left channel only
 * 11 = Stereo (PGA registers unused) Note:
 * ensure that LINVOL and RINVOL settings
 * (reg. 0 and 1) are the same before entering this mode.
 */
#define WM8960_ALC1_ALCSEL_MASK (0x180U)
#define WM8960_ALC1_ALCSEL_SHIFT (7U)
#define WM8960_ALC1_ALCSEL_SET(x) (((uint16_t)(x) << WM8960_ALC1_ALCSEL_SHIFT) & WM8960_ALC1_ALCSEL_MASK)
#define WM8960_ALC1_ALCSEL_GET(x) (((uint16_t)(x) & WM8960_ALC1_ALCSEL_MASK) >> WM8960_ALC1_ALCSEL_SHIFT)

/*
 * MAXGAIN (RW)
 *
 * Set Maximum Gain of PGA (During ALC
 * operation)
 * 111 : +30dB
 * 110 : +24dB
 * ….(-6dB steps)
 * 001 : -6dB
 * 000 : -12dB
 */
#define WM8960_ALC1_MAXGAIN_MASK (0x70U)
#define WM8960_ALC1_MAXGAIN_SHIFT (4U)
#define WM8960_ALC1_MAXGAIN_SET(x) (((uint16_t)(x) << WM8960_ALC1_MAXGAIN_SHIFT) & WM8960_ALC1_MAXGAIN_MASK)
#define WM8960_ALC1_MAXGAIN_GET(x) (((uint16_t)(x) & WM8960_ALC1_MAXGAIN_MASK) >> WM8960_ALC1_MAXGAIN_SHIFT)

/*
 * ALCL (RW)
 *
 * ALC Target (Sets signal level at ADC input)
 * 0000 = -22.5dB FS
 * 0001 = -21.0dB FS
 * … (1.5dB steps)
 * 1101 = -3.0dB FS
 * 1110 = -1.5dB FS
 * 1111 = -1.5dB FS
 */
#define WM8960_ALC1_ALCL_MASK (0xFU)
#define WM8960_ALC1_ALCL_SHIFT (0U)
#define WM8960_ALC1_ALCL_SET(x) (((uint16_t)(x) << WM8960_ALC1_ALCL_SHIFT) & WM8960_ALC1_ALCL_MASK)
#define WM8960_ALC1_ALCL_GET(x) (((uint16_t)(x) & WM8960_ALC1_ALCL_MASK) >> WM8960_ALC1_ALCL_SHIFT)

/* Bitfield definition for register: ALC2 */
/*
 * MINGAIN (RW)
 *
 * Set Minimum Gain of PGA (During ALC
 * operation)
 * 000 = -17.25dB
 * 001 = -11.25dB
 * 010 = -5.25dB
 * 011 = +0.75dB
 * 100 = +6.75dB
 * 101 = +12.75dB
 * 110 = +18.75dB
 * 111 = +24.75dB
 */
#define WM8960_ALC2_MINGAIN_MASK (0x70U)
#define WM8960_ALC2_MINGAIN_SHIFT (4U)
#define WM8960_ALC2_MINGAIN_SET(x) (((uint16_t)(x) << WM8960_ALC2_MINGAIN_SHIFT) & WM8960_ALC2_MINGAIN_MASK)
#define WM8960_ALC2_MINGAIN_GET(x) (((uint16_t)(x) & WM8960_ALC2_MINGAIN_MASK) >> WM8960_ALC2_MINGAIN_SHIFT)

/*
 * HLD (RW)
 *
 * ALC hold time before gain is increased.
 * 0000 = 0ms
 * 0001 = 2.67ms
 * 0010 = 5.33ms
 * … (time doubles with every step)
 * 1111 = 43.691s
 */
#define WM8960_ALC2_HLD_MASK (0xFU)
#define WM8960_ALC2_HLD_SHIFT (0U)
#define WM8960_ALC2_HLD_SET(x) (((uint16_t)(x) << WM8960_ALC2_HLD_SHIFT) & WM8960_ALC2_HLD_MASK)
#define WM8960_ALC2_HLD_GET(x) (((uint16_t)(x) & WM8960_ALC2_HLD_MASK) >> WM8960_ALC2_HLD_SHIFT)

/* Bitfield definition for register: ALC3 */
/*
 * ALCMODE (RW)
 *
 * Determines the ALC mode of operation:
 * 0 = ALC mode
 * 1 = Limiter mode
 */
#define WM8960_ALC3_ALCMODE_MASK (0x100U)
#define WM8960_ALC3_ALCMODE_SHIFT (8U)
#define WM8960_ALC3_ALCMODE_SET(x) (((uint16_t)(x) << WM8960_ALC3_ALCMODE_SHIFT) & WM8960_ALC3_ALCMODE_MASK)
#define WM8960_ALC3_ALCMODE_GET(x) (((uint16_t)(x) & WM8960_ALC3_ALCMODE_MASK) >> WM8960_ALC3_ALCMODE_SHIFT)

/*
 * DCY (RW)
 *
 * ALC decay (gain ramp-up) time
 * 0000 = 24ms
 * 0001 = 48ms
 * 0010 = 96ms
 * … (time doubles with every step)
 * 1010 or higher = 24.58s
 */
#define WM8960_ALC3_DCY_MASK (0xF0U)
#define WM8960_ALC3_DCY_SHIFT (4U)
#define WM8960_ALC3_DCY_SET(x) (((uint16_t)(x) << WM8960_ALC3_DCY_SHIFT) & WM8960_ALC3_DCY_MASK)
#define WM8960_ALC3_DCY_GET(x) (((uint16_t)(x) & WM8960_ALC3_DCY_MASK) >> WM8960_ALC3_DCY_SHIFT)

/*
 * ATK (RW)
 *
 * ALC attack (gain ramp-down) time
 * 0000 = 6ms
 * 0001 = 12ms
 * 0010 = 24ms
 * … (time doubles with every step)
 * 1010 or higher = 6.14s
 */
#define WM8960_ALC3_ATK_MASK (0xFU)
#define WM8960_ALC3_ATK_SHIFT (0U)
#define WM8960_ALC3_ATK_SET(x) (((uint16_t)(x) << WM8960_ALC3_ATK_SHIFT) & WM8960_ALC3_ATK_MASK)
#define WM8960_ALC3_ATK_GET(x) (((uint16_t)(x) & WM8960_ALC3_ATK_MASK) >> WM8960_ALC3_ATK_SHIFT)

/* Bitfield definition for register: NOISEG */
/*
 * NGTH (RW)
 *
 * Noise gate threshold
 * 00000 -76.5dBfs
 * 00001 -75dBfs
 * … 1.5 dB steps
 * 11110 -31.5dBfs
 * 11111 -30dBfs
 */
#define WM8960_NOISEG_NGTH_MASK (0xF8U)
#define WM8960_NOISEG_NGTH_SHIFT (3U)
#define WM8960_NOISEG_NGTH_SET(x) (((uint16_t)(x) << WM8960_NOISEG_NGTH_SHIFT) & WM8960_NOISEG_NGTH_MASK)
#define WM8960_NOISEG_NGTH_GET(x) (((uint16_t)(x) & WM8960_NOISEG_NGTH_MASK) >> WM8960_NOISEG_NGTH_SHIFT)

/*
 * NGAT (RW)
 *
 * Noise gate function enable
 * 0 = disable
 * 1 = enable
 */
#define WM8960_NOISEG_NGAT_MASK (0x1U)
#define WM8960_NOISEG_NGAT_SHIFT (0U)
#define WM8960_NOISEG_NGAT_SET(x) (((uint16_t)(x) << WM8960_NOISEG_NGAT_SHIFT) & WM8960_NOISEG_NGAT_MASK)
#define WM8960_NOISEG_NGAT_GET(x) (((uint16_t)(x) & WM8960_NOISEG_NGAT_MASK) >> WM8960_NOISEG_NGAT_SHIFT)

/* Bitfield definition for register: LADC */
/*
 * ADCVU (RW)
 *
 * ADC Volume Update
 * Writing a 1 to this bit will cause left and right
 * ADC volumes to be updated (LADCVOL and
 * RADCVOL)
 */
#define WM8960_LADC_ADCVU_MASK (0x100U)
#define WM8960_LADC_ADCVU_SHIFT (8U)
#define WM8960_LADC_ADCVU_SET(x) (((uint16_t)(x) << WM8960_LADC_ADCVU_SHIFT) & WM8960_LADC_ADCVU_MASK)
#define WM8960_LADC_ADCVU_GET(x) (((uint16_t)(x) & WM8960_LADC_ADCVU_MASK) >> WM8960_LADC_ADCVU_SHIFT)

/*
 * LADCVOL (RW)
 *
 * Left ADC Digital Volume Control
 * 0000 0000 = Digital Mute
 * 0000 0001 = -97dB
 * 0000 0010 = -96.5dB
 * ... 0.5dB steps up to
 * 1111 1111 = +30dB
 */
#define WM8960_LADC_LADCVOL_MASK (0xFFU)
#define WM8960_LADC_LADCVOL_SHIFT (0U)
#define WM8960_LADC_LADCVOL_SET(x) (((uint16_t)(x) << WM8960_LADC_LADCVOL_SHIFT) & WM8960_LADC_LADCVOL_MASK)
#define WM8960_LADC_LADCVOL_GET(x) (((uint16_t)(x) & WM8960_LADC_LADCVOL_MASK) >> WM8960_LADC_LADCVOL_SHIFT)

/* Bitfield definition for register: RADC */
/*
 * ADCVU (RW)
 *
 * ADC Volume Update
 * Writing a 1 to this bit will cause left and right
 * ADC volumes to be updated (LADCVOL and RADCVOL)
 */
#define WM8960_RADC_ADCVU_MASK (0x100U)
#define WM8960_RADC_ADCVU_SHIFT (8U)
#define WM8960_RADC_ADCVU_SET(x) (((uint16_t)(x) << WM8960_RADC_ADCVU_SHIFT) & WM8960_RADC_ADCVU_MASK)
#define WM8960_RADC_ADCVU_GET(x) (((uint16_t)(x) & WM8960_RADC_ADCVU_MASK) >> WM8960_RADC_ADCVU_SHIFT)

