RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * VREF (RW)
 *
 * VREF (necessary for all other functions)
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_VREF_MASK (0x40U)
#define WM8960_POWER1_VREF_SHIFT (6U)
#define WM8960_POWER1_VREF_SET(x) (((uint16_t)(x) << WM8960_POWER1_VREF_SHIFT) & WM8960_POWER1_VREF_MASK)
#define WM8960_POWER1_VREF_GET(x) (((uint16_t)(x) & WM8960_POWER1_VREF_MASK) >> WM8960_POWER1_VREF_SHIFT)

/*
 * AINL (RW)
 *
 * Analogue in PGA Left
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_AINL_MASK (0x20U)
#define WM8960_POWER1_AINL_SHIFT (5U)
#define WM8960_POWER1_AINL_SET(x) (((uint16_t)(x) << WM8960_POWER1_AINL_SHIFT) & WM8960_POWER1_AINL_MASK)
#define WM8960_POWER1_AINL_GET(x) (((uint16_t)(x) & WM8960_POWER1_AINL_MASK) >> WM8960_POWER1_AINL_SHIFT)

/*
 * AINR (RW)
 *
 * Analogue in PGA Right
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_AINR_MASK (0x10U)
#define WM8960_POWER1_AINR_SHIFT (4U)
#define WM8960_POWER1_AINR_SET(x) (((uint16_t)(x) << WM8960_POWER1_AINR_SHIFT) & WM8960_POWER1_AINR_MASK)
#define WM8960_POWER1_AINR_GET(x) (((uint16_t)(x) & WM8960_POWER1_AINR_MASK) >> WM8960_POWER1_AINR_SHIFT)

/*
 * ADCL (RW)
 *
 * ADC Left
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_ADCL_MASK (0x8U)
#define WM8960_POWER1_ADCL_SHIFT (3U)
#define WM8960_POWER1_ADCL_SET(x) (((uint16_t)(x) << WM8960_POWER1_ADCL_SHIFT) & WM8960_POWER1_ADCL_MASK)
#define WM8960_POWER1_ADCL_GET(x) (((uint16_t)(x) & WM8960_POWER1_ADCL_MASK) >> WM8960_POWER1_ADCL_SHIFT)

/*
 * ADCR (RW)
 *
 * ADC Right
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_ADCR_MASK (0x4U)
#define WM8960_POWER1_ADCR_SHIFT (2U)
#define WM8960_POWER1_ADCR_SET(x) (((uint16_t)(x) << WM8960_POWER1_ADCR_SHIFT) & WM8960_POWER1_ADCR_MASK)
#define WM8960_POWER1_ADCR_GET(x) (((uint16_t)(x) & WM8960_POWER1_ADCR_MASK) >> WM8960_POWER1_ADCR_SHIFT)

/*
 * MICB (RW)
 *
 * MICBIAS
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER1_MICB_MASK (0x2U)
#define WM8960_POWER1_MICB_SHIFT (1U)
#define WM8960_POWER1_MICB_SET(x) (((uint16_t)(x) << WM8960_POWER1_MICB_SHIFT) & WM8960_POWER1_MICB_MASK)
#define WM8960_POWER1_MICB_GET(x) (((uint16_t)(x) & WM8960_POWER1_MICB_MASK) >> WM8960_POWER1_MICB_SHIFT)

/*
 * DIGENB (RW)
 *
 * Master Clock Disable
 * 0 = Master clock enabled
 * 1 = Master clock disabled
 */
#define WM8960_POWER1_DIGENB_MASK (0x1U)
#define WM8960_POWER1_DIGENB_SHIFT (0U)
#define WM8960_POWER1_DIGENB_SET(x) (((uint16_t)(x) << WM8960_POWER1_DIGENB_SHIFT) & WM8960_POWER1_DIGENB_MASK)
#define WM8960_POWER1_DIGENB_GET(x) (((uint16_t)(x) & WM8960_POWER1_DIGENB_MASK) >> WM8960_POWER1_DIGENB_SHIFT)

/* Bitfield definition for register: POWER2 */
/*
 * DACL (RW)
 *
 * DAC Left
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_DACL_MASK (0x100U)
#define WM8960_POWER2_DACL_SHIFT (8U)
#define WM8960_POWER2_DACL_SET(x) (((uint16_t)(x) << WM8960_POWER2_DACL_SHIFT) & WM8960_POWER2_DACL_MASK)
#define WM8960_POWER2_DACL_GET(x) (((uint16_t)(x) & WM8960_POWER2_DACL_MASK) >> WM8960_POWER2_DACL_SHIFT)

/*
 * DACR (RW)
 *
 * DAC Right
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_DACR_MASK (0x80U)
#define WM8960_POWER2_DACR_SHIFT (7U)
#define WM8960_POWER2_DACR_SET(x) (((uint16_t)(x) << WM8960_POWER2_DACR_SHIFT) & WM8960_POWER2_DACR_MASK)
#define WM8960_POWER2_DACR_GET(x) (((uint16_t)(x) & WM8960_POWER2_DACR_MASK) >> WM8960_POWER2_DACR_SHIFT)

/*
 * LOUT1 (RW)
 *
 * LOUT1 Output Buffer
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_LOUT1_MASK (0x40U)
#define WM8960_POWER2_LOUT1_SHIFT (6U)
#define WM8960_POWER2_LOUT1_SET(x) (((uint16_t)(x) << WM8960_POWER2_LOUT1_SHIFT) & WM8960_POWER2_LOUT1_MASK)
#define WM8960_POWER2_LOUT1_GET(x) (((uint16_t)(x) & WM8960_POWER2_LOUT1_MASK) >> WM8960_POWER2_LOUT1_SHIFT)

/*
 * ROUT1 (RW)
 *
 * ROUT1 Output Buffer
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_ROUT1_MASK (0x20U)
#define WM8960_POWER2_ROUT1_SHIFT (5U)
#define WM8960_POWER2_ROUT1_SET(x) (((uint16_t)(x) << WM8960_POWER2_ROUT1_SHIFT) & WM8960_POWER2_ROUT1_MASK)
#define WM8960_POWER2_ROUT1_GET(x) (((uint16_t)(x) & WM8960_POWER2_ROUT1_MASK) >> WM8960_POWER2_ROUT1_SHIFT)

/*
 * SPKL (RW)
 *
 * SPK_LP/SPK_LN Output Buffers
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_SPKL_MASK (0x10U)
#define WM8960_POWER2_SPKL_SHIFT (4U)
#define WM8960_POWER2_SPKL_SET(x) (((uint16_t)(x) << WM8960_POWER2_SPKL_SHIFT) & WM8960_POWER2_SPKL_MASK)
#define WM8960_POWER2_SPKL_GET(x) (((uint16_t)(x) & WM8960_POWER2_SPKL_MASK) >> WM8960_POWER2_SPKL_SHIFT)

/*
 * SPKR (RW)
 *
 * SPK_RP/SPK_RN Output Buffers
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_SPKR_MASK (0x8U)
#define WM8960_POWER2_SPKR_SHIFT (3U)
#define WM8960_POWER2_SPKR_SET(x) (((uint16_t)(x) << WM8960_POWER2_SPKR_SHIFT) & WM8960_POWER2_SPKR_MASK)
#define WM8960_POWER2_SPKR_GET(x) (((uint16_t)(x) & WM8960_POWER2_SPKR_MASK) >> WM8960_POWER2_SPKR_SHIFT)

/*
 * OUT3 (RW)
 *
 * OUT3 Output Buffer
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_OUT3_MASK (0x2U)
#define WM8960_POWER2_OUT3_SHIFT (1U)
#define WM8960_POWER2_OUT3_SET(x) (((uint16_t)(x) << WM8960_POWER2_OUT3_SHIFT) & WM8960_POWER2_OUT3_MASK)
#define WM8960_POWER2_OUT3_GET(x) (((uint16_t)(x) & WM8960_POWER2_OUT3_MASK) >> WM8960_POWER2_OUT3_SHIFT)

/*
 * PLL_EN (RW)
 *
 * PLL Enable
 * 0 = Power down
 * 1 = Power up
 */
#define WM8960_POWER2_PLL_EN_MASK (0x1U)
#define WM8960_POWER2_PLL_EN_SHIFT (0U)
#define WM8960_POWER2_PLL_EN_SET(x) (((uint16_t)(x) << WM8960_POWER2_PLL_EN_SHIFT) & WM8960_POWER2_PLL_EN_MASK)
#define WM8960_POWER2_PLL_EN_GET(x) (((uint16_t)(x) & WM8960_POWER2_PLL_EN_MASK) >> WM8960_POWER2_PLL_EN_SHIFT)

/* Bitfield definition for register: ADDCTL3 */
/*
 * VROI (RW)
 *
 * VREF to Analogue Output Resistance (Disabled
 * Outputs)
 * 0 = 500 VMID to output
 * 1 = 20k VMID to output
 */
#define WM8960_ADDCTL3_VROI_MASK (0x40U)
#define WM8960_ADDCTL3_VROI_SHIFT (6U)
#define WM8960_ADDCTL3_VROI_SET(x) (((uint16_t)(x) << WM8960_ADDCTL3_VROI_SHIFT) & WM8960_ADDCTL3_VROI_MASK)
#define WM8960_ADDCTL3_VROI_GET(x) (((uint16_t)(x) & WM8960_ADDCTL3_VROI_MASK) >> WM8960_ADDCTL3_VROI_SHIFT)

