RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * OUT3CAP (RW)
 *
 * Capless Mode Headphone Switch Enable
 * 0 = OUT3 unaffected by jack detect events
 * 1 = OUT3 enabled and disabled together with
 * HP_L and HP_R in response to jack detect
 * events
 */
#define WM8960_ADDCTL3_OUT3CAP_MASK (0x8U)
#define WM8960_ADDCTL3_OUT3CAP_SHIFT (3U)
#define WM8960_ADDCTL3_OUT3CAP_SET(x) (((uint16_t)(x) << WM8960_ADDCTL3_OUT3CAP_SHIFT) & WM8960_ADDCTL3_OUT3CAP_MASK)
#define WM8960_ADDCTL3_OUT3CAP_GET(x) (((uint16_t)(x) & WM8960_ADDCTL3_OUT3CAP_MASK) >> WM8960_ADDCTL3_OUT3CAP_SHIFT)

/*
 * ADC_ALC_SR (RW)
 *
 * ALC Sample Rate
 * 000 = 44.1k / 48k
 * 001 = 32k
 * 010 = 22.05k / 24k
 * 011 = 16k
 * 100 = 11.25k / 12k
 * 101 = 8k
 * 110 and 111 = Reserved
 */
#define WM8960_ADDCTL3_ADC_ALC_SR_MASK (0x7U)
#define WM8960_ADDCTL3_ADC_ALC_SR_SHIFT (0U)
#define WM8960_ADDCTL3_ADC_ALC_SR_SET(x) (((uint16_t)(x) << WM8960_ADDCTL3_ADC_ALC_SR_SHIFT) & WM8960_ADDCTL3_ADC_ALC_SR_MASK)
#define WM8960_ADDCTL3_ADC_ALC_SR_GET(x) (((uint16_t)(x) & WM8960_ADDCTL3_ADC_ALC_SR_MASK) >> WM8960_ADDCTL3_ADC_ALC_SR_SHIFT)

/* Bitfield definition for register: APOP1 */
/*
 * POBCTRL (RW)
 *
 * Selects the bias current source for output
 * amplifiers and VMID buffer
 * 0 = VMID / R bias
 * 1 = VGS / R bias
 */
#define WM8960_APOP1_POBCTRL_MASK (0x80U)
#define WM8960_APOP1_POBCTRL_SHIFT (7U)
#define WM8960_APOP1_POBCTRL_SET(x) (((uint16_t)(x) << WM8960_APOP1_POBCTRL_SHIFT) & WM8960_APOP1_POBCTRL_MASK)
#define WM8960_APOP1_POBCTRL_GET(x) (((uint16_t)(x) & WM8960_APOP1_POBCTRL_MASK) >> WM8960_APOP1_POBCTRL_SHIFT)

/*
 * BUFDCOPEN (RW)
 *
 * Enables the VGS / R current generator
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_APOP1_BUFDCOPEN_MASK (0x10U)
#define WM8960_APOP1_BUFDCOPEN_SHIFT (4U)
#define WM8960_APOP1_BUFDCOPEN_SET(x) (((uint16_t)(x) << WM8960_APOP1_BUFDCOPEN_SHIFT) & WM8960_APOP1_BUFDCOPEN_MASK)
#define WM8960_APOP1_BUFDCOPEN_GET(x) (((uint16_t)(x) & WM8960_APOP1_BUFDCOPEN_MASK) >> WM8960_APOP1_BUFDCOPEN_SHIFT)

/*
 * BUFIOEN (RW)
 *
 * Enables the VGS / R current generator and the
 * analogue input and output bias
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_APOP1_BUFIOEN_MASK (0x8U)
#define WM8960_APOP1_BUFIOEN_SHIFT (3U)
#define WM8960_APOP1_BUFIOEN_SET(x) (((uint16_t)(x) << WM8960_APOP1_BUFIOEN_SHIFT) & WM8960_APOP1_BUFIOEN_MASK)
#define WM8960_APOP1_BUFIOEN_GET(x) (((uint16_t)(x) & WM8960_APOP1_BUFIOEN_MASK) >> WM8960_APOP1_BUFIOEN_SHIFT)

/*
 * SOFT_ST (RW)
 *
 * Enables VMID soft start
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_APOP1_SOFT_ST_MASK (0x4U)
#define WM8960_APOP1_SOFT_ST_SHIFT (2U)
#define WM8960_APOP1_SOFT_ST_SET(x) (((uint16_t)(x) << WM8960_APOP1_SOFT_ST_SHIFT) & WM8960_APOP1_SOFT_ST_MASK)
#define WM8960_APOP1_SOFT_ST_GET(x) (((uint16_t)(x) & WM8960_APOP1_SOFT_ST_MASK) >> WM8960_APOP1_SOFT_ST_SHIFT)

/*
 * HPSTBY (RW)
 *
 * Headphone Amplifier Standby
 * 0 = Standby mode disabled (Normal operation)
 * 1 = Standby mode enabled
 */
#define WM8960_APOP1_HPSTBY_MASK (0x1U)
#define WM8960_APOP1_HPSTBY_SHIFT (0U)
#define WM8960_APOP1_HPSTBY_SET(x) (((uint16_t)(x) << WM8960_APOP1_HPSTBY_SHIFT) & WM8960_APOP1_HPSTBY_MASK)
#define WM8960_APOP1_HPSTBY_GET(x) (((uint16_t)(x) & WM8960_APOP1_HPSTBY_MASK) >> WM8960_APOP1_HPSTBY_SHIFT)

/* Bitfield definition for register: APOP2 */
/*
 * DISOP (RW)
 *
 * Discharges the DC-blocking headphone
 * capacitors on HP_L and HP_R
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_APOP2_DISOP_MASK (0x40U)
#define WM8960_APOP2_DISOP_SHIFT (6U)
#define WM8960_APOP2_DISOP_SET(x) (((uint16_t)(x) << WM8960_APOP2_DISOP_SHIFT) & WM8960_APOP2_DISOP_MASK)
#define WM8960_APOP2_DISOP_GET(x) (((uint16_t)(x) & WM8960_APOP2_DISOP_MASK) >> WM8960_APOP2_DISOP_SHIFT)

/*
 * DRES (RW)
 *
 * DRES determines the value of the resistors used
 * to discharge the DC-blocking headphone
 * capacitors when DISOP=1
 * DRES[1:0] Resistance (Ohms)
 * 0 0 400
 * 0 1 200
 * 1 0 600
 * 1 1 150
 */
#define WM8960_APOP2_DRES_MASK (0x30U)
#define WM8960_APOP2_DRES_SHIFT (4U)
#define WM8960_APOP2_DRES_SET(x) (((uint16_t)(x) << WM8960_APOP2_DRES_SHIFT) & WM8960_APOP2_DRES_MASK)
#define WM8960_APOP2_DRES_GET(x) (((uint16_t)(x) & WM8960_APOP2_DRES_MASK) >> WM8960_APOP2_DRES_SHIFT)

/* Bitfield definition for register: LINPATH */
/*
 * LMN1 (RW)
 *
 * Connect LINPUT1 to inverting input of Left Input
 * PGA
 * 0 = LINPUT1 not connected to PGA
 * 1 = LINPUT1 connected to PGA
 */
#define WM8960_LINPATH_LMN1_MASK (0x100U)
#define WM8960_LINPATH_LMN1_SHIFT (8U)
#define WM8960_LINPATH_LMN1_SET(x) (((uint16_t)(x) << WM8960_LINPATH_LMN1_SHIFT) & WM8960_LINPATH_LMN1_MASK)
#define WM8960_LINPATH_LMN1_GET(x) (((uint16_t)(x) & WM8960_LINPATH_LMN1_MASK) >> WM8960_LINPATH_LMN1_SHIFT)

/*
 * LMP3 (RW)
 *
 * Connect LINPUT3 to non-inverting input of Left
 * Input PGA
 * 0 = LINPUT3 not connected to PGA
 * 1 = LINPUT3 connected to PGA (Constant input
 * impedance)
 */
#define WM8960_LINPATH_LMP3_MASK (0x80U)
#define WM8960_LINPATH_LMP3_SHIFT (7U)
#define WM8960_LINPATH_LMP3_SET(x) (((uint16_t)(x) << WM8960_LINPATH_LMP3_SHIFT) & WM8960_LINPATH_LMP3_MASK)
#define WM8960_LINPATH_LMP3_GET(x) (((uint16_t)(x) & WM8960_LINPATH_LMP3_MASK) >> WM8960_LINPATH_LMP3_SHIFT)

/*
 * LMP2 (RW)
 *
 * Connect LINPUT2 to non-inverting input of Left
 * Input PGA
 * 0 = LINPUT2 not connected to PGA
 * 1 = LINPUT2 connected to PGA (Constant input impedance)
 */
#define WM8960_LINPATH_LMP2_MASK (0x40U)
#define WM8960_LINPATH_LMP2_SHIFT (6U)
#define WM8960_LINPATH_LMP2_SET(x) (((uint16_t)(x) << WM8960_LINPATH_LMP2_SHIFT) & WM8960_LINPATH_LMP2_MASK)
#define WM8960_LINPATH_LMP2_GET(x) (((uint16_t)(x) & WM8960_LINPATH_LMP2_MASK) >> WM8960_LINPATH_LMP2_SHIFT)

/*
 * LMICBOOST (RW)
 *
 * Left Channel Input PGA Boost Gain
 * 00 = +0dB
 * 01 = +13dB
 * 10 = +20dB
 * 11 = +29dB
 */
#define WM8960_LINPATH_LMICBOOST_MASK (0x30U)
#define WM8960_LINPATH_LMICBOOST_SHIFT (4U)
#define WM8960_LINPATH_LMICBOOST_SET(x) (((uint16_t)(x) << WM8960_LINPATH_LMICBOOST_SHIFT) & WM8960_LINPATH_LMICBOOST_MASK)
#define WM8960_LINPATH_LMICBOOST_GET(x) (((uint16_t)(x) & WM8960_LINPATH_LMICBOOST_MASK) >> WM8960_LINPATH_LMICBOOST_SHIFT)

