RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * LMIC2B (RW)
 *
 * Connect Left Input PGA to Left Input Boost Mixer
 * 0 = Not connected
 * 1 = Connected
 */
#define WM8960_LINPATH_LMIC2B_MASK (0x8U)
#define WM8960_LINPATH_LMIC2B_SHIFT (3U)
#define WM8960_LINPATH_LMIC2B_SET(x) (((uint16_t)(x) << WM8960_LINPATH_LMIC2B_SHIFT) & WM8960_LINPATH_LMIC2B_MASK)
#define WM8960_LINPATH_LMIC2B_GET(x) (((uint16_t)(x) & WM8960_LINPATH_LMIC2B_MASK) >> WM8960_LINPATH_LMIC2B_SHIFT)

/* Bitfield definition for register: RINPATH */
/*
 * RMN1 (RW)
 *
 * Connect RINPUT1 to inverting input of Right
 * Input PGA
 * 0 = RINPUT1 not connected to PGA
 * 1 = RINPUT1 connected to PGA
 */
#define WM8960_RINPATH_RMN1_MASK (0x100U)
#define WM8960_RINPATH_RMN1_SHIFT (8U)
#define WM8960_RINPATH_RMN1_SET(x) (((uint16_t)(x) << WM8960_RINPATH_RMN1_SHIFT) & WM8960_RINPATH_RMN1_MASK)
#define WM8960_RINPATH_RMN1_GET(x) (((uint16_t)(x) & WM8960_RINPATH_RMN1_MASK) >> WM8960_RINPATH_RMN1_SHIFT)

/*
 * RMP3 (RW)
 *
 * Connect RINPUT3 to non-inverting input of Right
 * Input PGA
 * 0 = RINPUT3 not connected to PGA
 * 1 = RINPUT3 connected to PGA (Constant input impedance)
 */
#define WM8960_RINPATH_RMP3_MASK (0x80U)
#define WM8960_RINPATH_RMP3_SHIFT (7U)
#define WM8960_RINPATH_RMP3_SET(x) (((uint16_t)(x) << WM8960_RINPATH_RMP3_SHIFT) & WM8960_RINPATH_RMP3_MASK)
#define WM8960_RINPATH_RMP3_GET(x) (((uint16_t)(x) & WM8960_RINPATH_RMP3_MASK) >> WM8960_RINPATH_RMP3_SHIFT)

/*
 * RMP2 (RW)
 *
 * Connect RINPUT2 to non-inverting input of Right
 * Input PGA
 * 0 = RINPUT2 not connected to PGA
 * 1 = RINPUT2 connected to PGA (Constant input
 * impedance)
 */
#define WM8960_RINPATH_RMP2_MASK (0x40U)
#define WM8960_RINPATH_RMP2_SHIFT (6U)
#define WM8960_RINPATH_RMP2_SET(x) (((uint16_t)(x) << WM8960_RINPATH_RMP2_SHIFT) & WM8960_RINPATH_RMP2_MASK)
#define WM8960_RINPATH_RMP2_GET(x) (((uint16_t)(x) & WM8960_RINPATH_RMP2_MASK) >> WM8960_RINPATH_RMP2_SHIFT)

/*
 * RMICBOOST (RW)
 *
 * Right Channel Input PGA Boost Gain
 * 00 = +0dB
 * 01 = +13dB
 * 10 = +20dB
 * 11 = +29dB
 */
#define WM8960_RINPATH_RMICBOOST_MASK (0x30U)
#define WM8960_RINPATH_RMICBOOST_SHIFT (4U)
#define WM8960_RINPATH_RMICBOOST_SET(x) (((uint16_t)(x) << WM8960_RINPATH_RMICBOOST_SHIFT) & WM8960_RINPATH_RMICBOOST_MASK)
#define WM8960_RINPATH_RMICBOOST_GET(x) (((uint16_t)(x) & WM8960_RINPATH_RMICBOOST_MASK) >> WM8960_RINPATH_RMICBOOST_SHIFT)

/*
 * RMIC2B (RW)
 *
 * Connect Right Input PGA to Right Input Boost
 * Mixer
 * 0 = Not connected
 * 1 = Connected
 */
#define WM8960_RINPATH_RMIC2B_MASK (0x8U)
#define WM8960_RINPATH_RMIC2B_SHIFT (3U)
#define WM8960_RINPATH_RMIC2B_SET(x) (((uint16_t)(x) << WM8960_RINPATH_RMIC2B_SHIFT) & WM8960_RINPATH_RMIC2B_MASK)
#define WM8960_RINPATH_RMIC2B_GET(x) (((uint16_t)(x) & WM8960_RINPATH_RMIC2B_MASK) >> WM8960_RINPATH_RMIC2B_SHIFT)

/* Bitfield definition for register: LOUTMIX */
/*
 * LD2LO (RW)
 *
 * Left DAC to Left Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_LOUTMIX_LD2LO_MASK (0x100U)
#define WM8960_LOUTMIX_LD2LO_SHIFT (8U)
#define WM8960_LOUTMIX_LD2LO_SET(x) (((uint16_t)(x) << WM8960_LOUTMIX_LD2LO_SHIFT) & WM8960_LOUTMIX_LD2LO_MASK)
#define WM8960_LOUTMIX_LD2LO_GET(x) (((uint16_t)(x) & WM8960_LOUTMIX_LD2LO_MASK) >> WM8960_LOUTMIX_LD2LO_SHIFT)

/*
 * LI2LO (RW)
 *
 * LINPUT3 to Left Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_LOUTMIX_LI2LO_MASK (0x80U)
#define WM8960_LOUTMIX_LI2LO_SHIFT (7U)
#define WM8960_LOUTMIX_LI2LO_SET(x) (((uint16_t)(x) << WM8960_LOUTMIX_LI2LO_SHIFT) & WM8960_LOUTMIX_LI2LO_MASK)
#define WM8960_LOUTMIX_LI2LO_GET(x) (((uint16_t)(x) & WM8960_LOUTMIX_LI2LO_MASK) >> WM8960_LOUTMIX_LI2LO_SHIFT)

/*
 * LI2LOVOL (RW)
 *
 * LINPUT3 to Left Output Mixer Volume
 * 000 = 0dB
 * ...(3dB steps)
 * 111 = -21dB
 */
#define WM8960_LOUTMIX_LI2LOVOL_MASK (0x70U)
#define WM8960_LOUTMIX_LI2LOVOL_SHIFT (4U)
#define WM8960_LOUTMIX_LI2LOVOL_SET(x) (((uint16_t)(x) << WM8960_LOUTMIX_LI2LOVOL_SHIFT) & WM8960_LOUTMIX_LI2LOVOL_MASK)
#define WM8960_LOUTMIX_LI2LOVOL_GET(x) (((uint16_t)(x) & WM8960_LOUTMIX_LI2LOVOL_MASK) >> WM8960_LOUTMIX_LI2LOVOL_SHIFT)

/* Bitfield definition for register: ROUTMIX */
/*
 * RD2RO (RW)
 *
 * Right DAC to Right Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_ROUTMIX_RD2RO_MASK (0x100U)
#define WM8960_ROUTMIX_RD2RO_SHIFT (8U)
#define WM8960_ROUTMIX_RD2RO_SET(x) (((uint16_t)(x) << WM8960_ROUTMIX_RD2RO_SHIFT) & WM8960_ROUTMIX_RD2RO_MASK)
#define WM8960_ROUTMIX_RD2RO_GET(x) (((uint16_t)(x) & WM8960_ROUTMIX_RD2RO_MASK) >> WM8960_ROUTMIX_RD2RO_SHIFT)

/*
 * RI2RO (RW)
 *
 * RINPUT3 to Right Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_ROUTMIX_RI2RO_MASK (0x80U)
#define WM8960_ROUTMIX_RI2RO_SHIFT (7U)
#define WM8960_ROUTMIX_RI2RO_SET(x) (((uint16_t)(x) << WM8960_ROUTMIX_RI2RO_SHIFT) & WM8960_ROUTMIX_RI2RO_MASK)
#define WM8960_ROUTMIX_RI2RO_GET(x) (((uint16_t)(x) & WM8960_ROUTMIX_RI2RO_MASK) >> WM8960_ROUTMIX_RI2RO_SHIFT)

/*
 * RI2ROVOL (RW)
 *
 * RINPUT3 to Right Output Mixer Volume
 * 000 = 0dB
 * ...(3dB steps)
 * 111 = -21dB
 */
#define WM8960_ROUTMIX_RI2ROVOL_MASK (0x70U)
#define WM8960_ROUTMIX_RI2ROVOL_SHIFT (4U)
#define WM8960_ROUTMIX_RI2ROVOL_SET(x) (((uint16_t)(x) << WM8960_ROUTMIX_RI2ROVOL_SHIFT) & WM8960_ROUTMIX_RI2ROVOL_MASK)
#define WM8960_ROUTMIX_RI2ROVOL_GET(x) (((uint16_t)(x) & WM8960_ROUTMIX_RI2ROVOL_MASK) >> WM8960_ROUTMIX_RI2ROVOL_SHIFT)

/* Bitfield definition for register: MONOMIX1 */
/*
 * L2MO (RW)
 *
 * Left Output Mixer to Mono Output Mixer Control
 * 0 = Left channel mix disabled
 * 1 = Left channel mix enabled
 */
#define WM8960_MONOMIX1_L2MO_MASK (0x80U)
#define WM8960_MONOMIX1_L2MO_SHIFT (7U)
#define WM8960_MONOMIX1_L2MO_SET(x) (((uint16_t)(x) << WM8960_MONOMIX1_L2MO_SHIFT) & WM8960_MONOMIX1_L2MO_MASK)
#define WM8960_MONOMIX1_L2MO_GET(x) (((uint16_t)(x) & WM8960_MONOMIX1_L2MO_MASK) >> WM8960_MONOMIX1_L2MO_SHIFT)

/* Bitfield definition for register: MONOMIX2 */
/*
 * R2MO (RW)
 *
 * Right Output Mixer to Mono Output Mixer Control
 * 0 = Right channel mix disabled
 * 1 = Right channel mix enabled
 */
#define WM8960_MONOMIX2_R2MO_MASK (0x80U)
#define WM8960_MONOMIX2_R2MO_SHIFT (7U)
#define WM8960_MONOMIX2_R2MO_SET(x) (((uint16_t)(x) << WM8960_MONOMIX2_R2MO_SHIFT) & WM8960_MONOMIX2_R2MO_MASK)
#define WM8960_MONOMIX2_R2MO_GET(x) (((uint16_t)(x) & WM8960_MONOMIX2_R2MO_MASK) >> WM8960_MONOMIX2_R2MO_SHIFT)

/* Bitfield definition for register: LOUT2 */
/*
 * SPKVU (RW)
 *
 * Speaker Volume Update
 * Writing a 1 to this bit will cause left and right speaker volumes to be updated (SPKLVOL and SPKRVOL)
 */
#define WM8960_LOUT2_SPKVU_MASK (0x100U)
#define WM8960_LOUT2_SPKVU_SHIFT (8U)
#define WM8960_LOUT2_SPKVU_SET(x) (((uint16_t)(x) << WM8960_LOUT2_SPKVU_SHIFT) & WM8960_LOUT2_SPKVU_MASK)
#define WM8960_LOUT2_SPKVU_GET(x) (((uint16_t)(x) & WM8960_LOUT2_SPKVU_MASK) >> WM8960_LOUT2_SPKVU_SHIFT)

