RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * SPKLZC (RW)
 *
 * Left Speaker Zero Cross Enable
 * 1 = Change gain on zero cross only
 * 0 = Change gain immediately
 */
#define WM8960_LOUT2_SPKLZC_MASK (0x80U)
#define WM8960_LOUT2_SPKLZC_SHIFT (7U)
#define WM8960_LOUT2_SPKLZC_SET(x) (((uint16_t)(x) << WM8960_LOUT2_SPKLZC_SHIFT) & WM8960_LOUT2_SPKLZC_MASK)
#define WM8960_LOUT2_SPKLZC_GET(x) (((uint16_t)(x) & WM8960_LOUT2_SPKLZC_MASK) >> WM8960_LOUT2_SPKLZC_SHIFT)

/*
 * SPKLVOL (RW)
 *
 * SPK_LP/SPK_LN Volume
 * 1111111 = +6dB
 * … 1dB steps down to
 * 0110000 = -73dB
 * 0101111 to 0000000 = Analogue MUTE
 */
#define WM8960_LOUT2_SPKLVOL_MASK (0x7FU)
#define WM8960_LOUT2_SPKLVOL_SHIFT (0U)
#define WM8960_LOUT2_SPKLVOL_SET(x) (((uint16_t)(x) << WM8960_LOUT2_SPKLVOL_SHIFT) & WM8960_LOUT2_SPKLVOL_MASK)
#define WM8960_LOUT2_SPKLVOL_GET(x) (((uint16_t)(x) & WM8960_LOUT2_SPKLVOL_MASK) >> WM8960_LOUT2_SPKLVOL_SHIFT)

/* Bitfield definition for register: ROUT2 */
/*
 * SPKVU (RW)
 *
 * Speaker Volume Update
 * Writing a 1 to this bit will cause left and right
 * speaker volumes to be updated (SPKLVOL and SPKRVOL)
 */
#define WM8960_ROUT2_SPKVU_MASK (0x100U)
#define WM8960_ROUT2_SPKVU_SHIFT (8U)
#define WM8960_ROUT2_SPKVU_SET(x) (((uint16_t)(x) << WM8960_ROUT2_SPKVU_SHIFT) & WM8960_ROUT2_SPKVU_MASK)
#define WM8960_ROUT2_SPKVU_GET(x) (((uint16_t)(x) & WM8960_ROUT2_SPKVU_MASK) >> WM8960_ROUT2_SPKVU_SHIFT)

/*
 * SPKRZC (RW)
 *
 * Right Speaker Zero Cross Enable
 * 1 = Change gain on zero cross only
 * 0 = Change gain immediately
 */
#define WM8960_ROUT2_SPKRZC_MASK (0x80U)
#define WM8960_ROUT2_SPKRZC_SHIFT (7U)
#define WM8960_ROUT2_SPKRZC_SET(x) (((uint16_t)(x) << WM8960_ROUT2_SPKRZC_SHIFT) & WM8960_ROUT2_SPKRZC_MASK)
#define WM8960_ROUT2_SPKRZC_GET(x) (((uint16_t)(x) & WM8960_ROUT2_SPKRZC_MASK) >> WM8960_ROUT2_SPKRZC_SHIFT)

/*
 * SPKRVOL (RW)
 *
 * SPK_RP/SPK_RN Volume
 * 1111111 = +6dB
 * … 1dB steps down to
 * 0110000 = -73dB
 * 0101111 to 0000000 = Analogue MUTE
 */
#define WM8960_ROUT2_SPKRVOL_MASK (0x7FU)
#define WM8960_ROUT2_SPKRVOL_SHIFT (0U)
#define WM8960_ROUT2_SPKRVOL_SET(x) (((uint16_t)(x) << WM8960_ROUT2_SPKRVOL_SHIFT) & WM8960_ROUT2_SPKRVOL_MASK)
#define WM8960_ROUT2_SPKRVOL_GET(x) (((uint16_t)(x) & WM8960_ROUT2_SPKRVOL_MASK) >> WM8960_ROUT2_SPKRVOL_SHIFT)

/* Bitfield definition for register: MONO */
/*
 * MOUTVOL (RW)
 *
 * Mono Output Mixer Volume Control
 * 0 = 0dB
 * 1 = -6dB
 */
#define WM8960_MONO_MOUTVOL_MASK (0x40U)
#define WM8960_MONO_MOUTVOL_SHIFT (6U)
#define WM8960_MONO_MOUTVOL_SET(x) (((uint16_t)(x) << WM8960_MONO_MOUTVOL_SHIFT) & WM8960_MONO_MOUTVOL_MASK)
#define WM8960_MONO_MOUTVOL_GET(x) (((uint16_t)(x) & WM8960_MONO_MOUTVOL_MASK) >> WM8960_MONO_MOUTVOL_SHIFT)

/* Bitfield definition for register: INBMIX1 */
/*
 * LIN3BOOST (RW)
 *
 * LINPUT3 to Boost Mixer Gain
 * 000 = Mute
 * 001 = -12dB
 * ...3dB steps up to
 * 111 = +6dB
 */
#define WM8960_INBMIX1_LIN3BOOST_MASK (0x70U)
#define WM8960_INBMIX1_LIN3BOOST_SHIFT (4U)
#define WM8960_INBMIX1_LIN3BOOST_SET(x) (((uint16_t)(x) << WM8960_INBMIX1_LIN3BOOST_SHIFT) & WM8960_INBMIX1_LIN3BOOST_MASK)
#define WM8960_INBMIX1_LIN3BOOST_GET(x) (((uint16_t)(x) & WM8960_INBMIX1_LIN3BOOST_MASK) >> WM8960_INBMIX1_LIN3BOOST_SHIFT)

/*
 * LIN2BOOST (RW)
 *
 * LINPUT2 to Boost Mixer Gain
 * 000 = Mute
 * 001 = -12dB
 * ...3dB steps up to
 * 111 = +6dB
 */
#define WM8960_INBMIX1_LIN2BOOST_MASK (0xEU)
#define WM8960_INBMIX1_LIN2BOOST_SHIFT (1U)
#define WM8960_INBMIX1_LIN2BOOST_SET(x) (((uint16_t)(x) << WM8960_INBMIX1_LIN2BOOST_SHIFT) & WM8960_INBMIX1_LIN2BOOST_MASK)
#define WM8960_INBMIX1_LIN2BOOST_GET(x) (((uint16_t)(x) & WM8960_INBMIX1_LIN2BOOST_MASK) >> WM8960_INBMIX1_LIN2BOOST_SHIFT)

/* Bitfield definition for register: INBMIX2 */
/*
 * RIN3BOOST (RW)
 *
 * RINPUT3 to Boost Mixer Gain
 * 000 = Mute
 * 001 = -12dB
 * ...3dB steps up to
 * 111 = +6dB
 */
#define WM8960_INBMIX2_RIN3BOOST_MASK (0x70U)
#define WM8960_INBMIX2_RIN3BOOST_SHIFT (4U)
#define WM8960_INBMIX2_RIN3BOOST_SET(x) (((uint16_t)(x) << WM8960_INBMIX2_RIN3BOOST_SHIFT) & WM8960_INBMIX2_RIN3BOOST_MASK)
#define WM8960_INBMIX2_RIN3BOOST_GET(x) (((uint16_t)(x) & WM8960_INBMIX2_RIN3BOOST_MASK) >> WM8960_INBMIX2_RIN3BOOST_SHIFT)

/*
 * RIN2BOOST (RW)
 *
 * RINPUT2 to Boost Mixer Gain
 * 000 = Mute
 * 001 = -12dB
 * ...3dB steps up to
 * 111 = +6dB
 */
#define WM8960_INBMIX2_RIN2BOOST_MASK (0xEU)
#define WM8960_INBMIX2_RIN2BOOST_SHIFT (1U)
#define WM8960_INBMIX2_RIN2BOOST_SET(x) (((uint16_t)(x) << WM8960_INBMIX2_RIN2BOOST_SHIFT) & WM8960_INBMIX2_RIN2BOOST_MASK)
#define WM8960_INBMIX2_RIN2BOOST_GET(x) (((uint16_t)(x) & WM8960_INBMIX2_RIN2BOOST_MASK) >> WM8960_INBMIX2_RIN2BOOST_SHIFT)

/* Bitfield definition for register: BYPASS1 */
/*
 * LB2LO (RW)
 *
 * Left Input Boost Mixer to Left Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_BYPASS1_LB2LO_MASK (0x80U)
#define WM8960_BYPASS1_LB2LO_SHIFT (7U)
#define WM8960_BYPASS1_LB2LO_SET(x) (((uint16_t)(x) << WM8960_BYPASS1_LB2LO_SHIFT) & WM8960_BYPASS1_LB2LO_MASK)
#define WM8960_BYPASS1_LB2LO_GET(x) (((uint16_t)(x) & WM8960_BYPASS1_LB2LO_MASK) >> WM8960_BYPASS1_LB2LO_SHIFT)

/*
 * LB2LOVOL (RW)
 *
 * Left Input Boost Mixer to Left Output Mixer
 * Volume
 * 000 = 0dB
 * ...(3dB steps)
 * 111 = -21dB
 */
#define WM8960_BYPASS1_LB2LOVOL_MASK (0x70U)
#define WM8960_BYPASS1_LB2LOVOL_SHIFT (4U)
#define WM8960_BYPASS1_LB2LOVOL_SET(x) (((uint16_t)(x) << WM8960_BYPASS1_LB2LOVOL_SHIFT) & WM8960_BYPASS1_LB2LOVOL_MASK)
#define WM8960_BYPASS1_LB2LOVOL_GET(x) (((uint16_t)(x) & WM8960_BYPASS1_LB2LOVOL_MASK) >> WM8960_BYPASS1_LB2LOVOL_SHIFT)

/* Bitfield definition for register: BYPASS2 */
/*
 * RB2RO (RW)
 *
 * Right Input Boost Mixer to Right Output Mixer
 * 0 = Disable (Mute)
 * 1 = Enable Path
 */
#define WM8960_BYPASS2_RB2RO_MASK (0x80U)
#define WM8960_BYPASS2_RB2RO_SHIFT (7U)
#define WM8960_BYPASS2_RB2RO_SET(x) (((uint16_t)(x) << WM8960_BYPASS2_RB2RO_SHIFT) & WM8960_BYPASS2_RB2RO_MASK)
#define WM8960_BYPASS2_RB2RO_GET(x) (((uint16_t)(x) & WM8960_BYPASS2_RB2RO_MASK) >> WM8960_BYPASS2_RB2RO_SHIFT)

