RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * RB2ROVOL (RW)
 *
 * Right Input Boost Mixer to Right Output Mixer
 * Volume
 * 000 = 0dB
 * ...(3dB steps)
 * 111 = -21dB
 */
#define WM8960_BYPASS2_RB2ROVOL_MASK (0x70U)
#define WM8960_BYPASS2_RB2ROVOL_SHIFT (4U)
#define WM8960_BYPASS2_RB2ROVOL_SET(x) (((uint16_t)(x) << WM8960_BYPASS2_RB2ROVOL_SHIFT) & WM8960_BYPASS2_RB2ROVOL_MASK)
#define WM8960_BYPASS2_RB2ROVOL_GET(x) (((uint16_t)(x) & WM8960_BYPASS2_RB2ROVOL_MASK) >> WM8960_BYPASS2_RB2ROVOL_SHIFT)

/* Bitfield definition for register: POWER3 */
/*
 * LMIC (RW)
 *
 * Left Channel Input PGA Enable
 * 0 = PGA disabled
 * 1 = PGA enabled (if AINL = 1)
 */
#define WM8960_POWER3_LMIC_MASK (0x20U)
#define WM8960_POWER3_LMIC_SHIFT (5U)
#define WM8960_POWER3_LMIC_SET(x) (((uint16_t)(x) << WM8960_POWER3_LMIC_SHIFT) & WM8960_POWER3_LMIC_MASK)
#define WM8960_POWER3_LMIC_GET(x) (((uint16_t)(x) & WM8960_POWER3_LMIC_MASK) >> WM8960_POWER3_LMIC_SHIFT)

/*
 * RMIC (RW)
 *
 * Right Channel Input PGA Enable
 * 0 = PGA disabled
 * 1 = PGA enabled (if AINR = 1)
 */
#define WM8960_POWER3_RMIC_MASK (0x10U)
#define WM8960_POWER3_RMIC_SHIFT (4U)
#define WM8960_POWER3_RMIC_SET(x) (((uint16_t)(x) << WM8960_POWER3_RMIC_SHIFT) & WM8960_POWER3_RMIC_MASK)
#define WM8960_POWER3_RMIC_GET(x) (((uint16_t)(x) & WM8960_POWER3_RMIC_MASK) >> WM8960_POWER3_RMIC_SHIFT)

/*
 * LOMIX (RW)
 *
 * Left Output Mixer Enable Control
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_POWER3_LOMIX_MASK (0x8U)
#define WM8960_POWER3_LOMIX_SHIFT (3U)
#define WM8960_POWER3_LOMIX_SET(x) (((uint16_t)(x) << WM8960_POWER3_LOMIX_SHIFT) & WM8960_POWER3_LOMIX_MASK)
#define WM8960_POWER3_LOMIX_GET(x) (((uint16_t)(x) & WM8960_POWER3_LOMIX_MASK) >> WM8960_POWER3_LOMIX_SHIFT)

/*
 * ROMIX (RW)
 *
 * Right Output Mixer Enable Control
 * 0 = Disabled
 * 1 = Enabled
 */
#define WM8960_POWER3_ROMIX_MASK (0x4U)
#define WM8960_POWER3_ROMIX_SHIFT (2U)
#define WM8960_POWER3_ROMIX_SET(x) (((uint16_t)(x) << WM8960_POWER3_ROMIX_SHIFT) & WM8960_POWER3_ROMIX_MASK)
#define WM8960_POWER3_ROMIX_GET(x) (((uint16_t)(x) & WM8960_POWER3_ROMIX_MASK) >> WM8960_POWER3_ROMIX_SHIFT)

/* Bitfield definition for register: ADDCTL4 */
/*
 * GPIOPOL (RW)
 *
 * GPIO Polarity Invert
 * 0 = Non inverted
 * 1 = Inverted
 */
#define WM8960_ADDCTL4_GPIOPOL_MASK (0x80U)
#define WM8960_ADDCTL4_GPIOPOL_SHIFT (7U)
#define WM8960_ADDCTL4_GPIOPOL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_GPIOPOL_SHIFT) & WM8960_ADDCTL4_GPIOPOL_MASK)
#define WM8960_ADDCTL4_GPIOPOL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_GPIOPOL_MASK) >> WM8960_ADDCTL4_GPIOPOL_SHIFT)

/*
 * GPIOSEL (RW)
 *
 * ADCLRC/GPIO1 GPIO Function Select:
 * 000 = Jack detect input
 * 001 = Reserved
 * 010 = Temperature ok
 * 011 = Debounced jack detect output
 * 100 = SYSCLK output
 * 101 = PLL lock
 * 110 = Logic 0
 * 111 = Logic 1
 */
#define WM8960_ADDCTL4_GPIOSEL_MASK (0x70U)
#define WM8960_ADDCTL4_GPIOSEL_SHIFT (4U)
#define WM8960_ADDCTL4_GPIOSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_GPIOSEL_SHIFT) & WM8960_ADDCTL4_GPIOSEL_MASK)
#define WM8960_ADDCTL4_GPIOSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_GPIOSEL_MASK) >> WM8960_ADDCTL4_GPIOSEL_SHIFT)

/*
 * HPSEL (RW)
 *
 * Headphone Switch Input Select
 * 0X = GPIO1 used for jack detect input (Requires
 * ADCLRC pin to be configured as a GPIO)
 * 10 = JD2 used for jack detect input
 * 11 = JD3 used for jack detect input
 */
#define WM8960_ADDCTL4_HPSEL_MASK (0xCU)
#define WM8960_ADDCTL4_HPSEL_SHIFT (2U)
#define WM8960_ADDCTL4_HPSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_HPSEL_SHIFT) & WM8960_ADDCTL4_HPSEL_MASK)
#define WM8960_ADDCTL4_HPSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_HPSEL_MASK) >> WM8960_ADDCTL4_HPSEL_SHIFT)

/*
 * TSENSEN (RW)
 *
 * Temperature Sensor Enable
 * 0 = Temperature sensor disabled
 * 1 = Temperature sensor enabled
 */
#define WM8960_ADDCTL4_TSENSEN_MASK (0x2U)
#define WM8960_ADDCTL4_TSENSEN_SHIFT (1U)
#define WM8960_ADDCTL4_TSENSEN_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_TSENSEN_SHIFT) & WM8960_ADDCTL4_TSENSEN_MASK)
#define WM8960_ADDCTL4_TSENSEN_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_TSENSEN_MASK) >> WM8960_ADDCTL4_TSENSEN_SHIFT)

/*
 * MBSEL (RW)
 *
 * Microphone Bias Voltage Control
 * 0 = 0.9 * AVDD
 * 1 = 0.65 * AVDD
 */
#define WM8960_ADDCTL4_MBSEL_MASK (0x1U)
#define WM8960_ADDCTL4_MBSEL_SHIFT (0U)
#define WM8960_ADDCTL4_MBSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_MBSEL_SHIFT) & WM8960_ADDCTL4_MBSEL_MASK)
#define WM8960_ADDCTL4_MBSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_MBSEL_MASK) >> WM8960_ADDCTL4_MBSEL_SHIFT)

/* Bitfield definition for register: CLASSD1 */
/*
 * SPK_OP_EN (RW)
 *
 * Enable Class D Speaker Outputs
 * 00 = Off
 * 01 = Left speaker only
 * 10 = Right speaker only
 * 11 = Left and right speakers enabled
 */
#define WM8960_CLASSD1_SPK_OP_EN_MASK (0xC0U)
#define WM8960_CLASSD1_SPK_OP_EN_SHIFT (6U)
#define WM8960_CLASSD1_SPK_OP_EN_SET(x) (((uint16_t)(x) << WM8960_CLASSD1_SPK_OP_EN_SHIFT) & WM8960_CLASSD1_SPK_OP_EN_MASK)
#define WM8960_CLASSD1_SPK_OP_EN_GET(x) (((uint16_t)(x) & WM8960_CLASSD1_SPK_OP_EN_MASK) >> WM8960_CLASSD1_SPK_OP_EN_SHIFT)

/* Bitfield definition for register: CLASSD3 */
/*
 * DCGAIN (RW)
 *
 * DC Speaker Boost (Boosts speaker DC output
 * level by up to 1.8 x on left and right channels)
 * 000 = 1.00x boost (+0dB)
 * 001 = 1.27x boost (+2.1dB)
 * 010 = 1.40x boost (+2.9dB)
 * 011 = 1.52x boost (+3.6dB)
 * 100 = 1.67x boost (+4.5dB)
 * 101 = 1.8x boost (+5.1dB)
 * 110 to 111 = Reserved
 */
#define WM8960_CLASSD3_DCGAIN_MASK (0x38U)
#define WM8960_CLASSD3_DCGAIN_SHIFT (3U)
#define WM8960_CLASSD3_DCGAIN_SET(x) (((uint16_t)(x) << WM8960_CLASSD3_DCGAIN_SHIFT) & WM8960_CLASSD3_DCGAIN_MASK)
#define WM8960_CLASSD3_DCGAIN_GET(x) (((uint16_t)(x) & WM8960_CLASSD3_DCGAIN_MASK) >> WM8960_CLASSD3_DCGAIN_SHIFT)

/*
 * ACGAIN (RW)
 *
 * AC Speaker Boost (Boosts speaker AC output
 * signal by up to 1.8 x on left and right channels)
 * 000 = 1.00x boost (+0dB)
 * 001 = 1.27x boost (+2.1dB)
 * 010 = 1.40x boost (+2.9dB)
 * 011 = 1.52x boost (+3.6dB)
 * 100 = 1.67x boost (+4.5dB)
 * 101 = 1.8x boost (+5.1dB)
 * 110 to 111 = Reserved
 */
#define WM8960_CLASSD3_ACGAIN_MASK (0x7U)
#define WM8960_CLASSD3_ACGAIN_SHIFT (0U)
#define WM8960_CLASSD3_ACGAIN_SET(x) (((uint16_t)(x) << WM8960_CLASSD3_ACGAIN_SHIFT) & WM8960_CLASSD3_ACGAIN_MASK)
#define WM8960_CLASSD3_ACGAIN_GET(x) (((uint16_t)(x) & WM8960_CLASSD3_ACGAIN_MASK) >> WM8960_CLASSD3_ACGAIN_SHIFT)

/* Bitfield definition for register: PLL1 */
/*
 * OPCLKDIV (RW)
 *
 * SYSCLK Output to GPIO Clock Division ratio
 * 000 = SYSCLK
 * 001 = SYSCLK / 2
 * 010 = SYSCLK / 3
 * 011 = SYSCLK / 4
 * 100 = SYSCLK / 5.5
 * 101 = SYSCLK / 6
 */
#define WM8960_PLL1_OPCLKDIV_MASK (0x1C0U)
#define WM8960_PLL1_OPCLKDIV_SHIFT (6U)
#define WM8960_PLL1_OPCLKDIV_SET(x) (((uint16_t)(x) << WM8960_PLL1_OPCLKDIV_SHIFT) & WM8960_PLL1_OPCLKDIV_MASK)
#define WM8960_PLL1_OPCLKDIV_GET(x) (((uint16_t)(x) & WM8960_PLL1_OPCLKDIV_MASK) >> WM8960_PLL1_OPCLKDIV_SHIFT)

