RT-Thread/rt-thread/bsp/hpmicro/hpm5e00evk/board/hpm_wm8960_regs.h
/*
 * SDM (RW)
 *
 * Enable Integer Mode
 * 0 = Integer mode
 * 1 = Fractional mode
 */
#define WM8960_PLL1_SDM_MASK (0x20U)
#define WM8960_PLL1_SDM_SHIFT (5U)
#define WM8960_PLL1_SDM_SET(x) (((uint16_t)(x) << WM8960_PLL1_SDM_SHIFT) & WM8960_PLL1_SDM_MASK)
#define WM8960_PLL1_SDM_GET(x) (((uint16_t)(x) & WM8960_PLL1_SDM_MASK) >> WM8960_PLL1_SDM_SHIFT)

/*
 * PLLPRESCALE (RW)
 *
 * Divide MCLK by 2 before input to PLL
 * 0 = Divide by 1
 * 1 = Divide by 2
 */
#define WM8960_PLL1_PLLPRESCALE_MASK (0x10U)
#define WM8960_PLL1_PLLPRESCALE_SHIFT (4U)
#define WM8960_PLL1_PLLPRESCALE_SET(x) (((uint16_t)(x) << WM8960_PLL1_PLLPRESCALE_SHIFT) & WM8960_PLL1_PLLPRESCALE_MASK)
#define WM8960_PLL1_PLLPRESCALE_GET(x) (((uint16_t)(x) & WM8960_PLL1_PLLPRESCALE_MASK) >> WM8960_PLL1_PLLPRESCALE_SHIFT)

/*
 * PLLN (RW)
 *
 * Integer (N) part of PLL input/output frequency
 * ratio. Use values greater than 5 and less than 13
 */
#define WM8960_PLL1_PLLN_MASK (0xFU)
#define WM8960_PLL1_PLLN_SHIFT (0U)
#define WM8960_PLL1_PLLN_SET(x) (((uint16_t)(x) << WM8960_PLL1_PLLN_SHIFT) & WM8960_PLL1_PLLN_MASK)
#define WM8960_PLL1_PLLN_GET(x) (((uint16_t)(x) & WM8960_PLL1_PLLN_MASK) >> WM8960_PLL1_PLLN_SHIFT)

/* Bitfield definition for register: PLL2 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL2_PLLK_MASK (0xFFU)
#define WM8960_PLL2_PLLK_SHIFT (0U)
#define WM8960_PLL2_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL2_PLLK_SHIFT) & WM8960_PLL2_PLLK_MASK)
#define WM8960_PLL2_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL2_PLLK_MASK) >> WM8960_PLL2_PLLK_SHIFT)

/* Bitfield definition for register: PLL3 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL3_PLLK_MASK (0xFFU)
#define WM8960_PLL3_PLLK_SHIFT (0U)
#define WM8960_PLL3_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL3_PLLK_SHIFT) & WM8960_PLL3_PLLK_MASK)
#define WM8960_PLL3_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL3_PLLK_MASK) >> WM8960_PLL3_PLLK_SHIFT)

/* Bitfield definition for register: PLL4 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL4_PLLK_MASK (0xFFU)
#define WM8960_PLL4_PLLK_SHIFT (0U)
#define WM8960_PLL4_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL4_PLLK_SHIFT) & WM8960_PLL4_PLLK_MASK)
#define WM8960_PLL4_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL4_PLLK_MASK) >> WM8960_PLL4_PLLK_SHIFT)


#endif /* _HPM_WM8960_REG_H_ */
